modules/framework/docs/design/authentication-design.md
```mermaid
sequenceDiagram
    actor toby as "Toby (Tester)" 
    participant webUI as "Galasa Web UI" 
    participant Dex as Dex
    participant db as "Configured Users DB" 

    toby ->> webUI: Get request
    webUI ->> toby: Logon challenge
    toby -->> webUI: User id and password
        webUI ->> Dex: "Authentication request (user login)"
            Dex ->> db: Authentication request
            db -->> Dex :  User is valid Response
        Dex -->> webUI: OK
    webUI -->> toby: main web app UI
```
