modules/framework/docs/design/authentication-design.md
```mermaid
sequenceDiagram
    actor toby as "Toby (Tester)"
    participant webUI as "Galasa Web UI" 
    participant auth as "Auth Service"
    participant Dex as Dex

    toby ->> webUI: Add personal access token
            webUI ->> auth : Add personal access token 
                    auth ->> Dex : Add personal acces token as valid
                    Dex -->> auth : OK
            auth -->> webUI : OK
    webUI -->> toby : Personal Access Token appears on panel
```
