modules/framework/docs/design/authentication-design.md
```mermaid
sequenceDiagram
    actor toby as "Toby (Tester)"
    participant cli as "Command line tool"
    participant env as "Environment"
    participant auth as "Auth Service"
    participant Dex as Dex


    toby->> cli: login(personal access token)
    cli->> auth : authenticate(personal access token) 
    auth->> Dex : Is this personal access tokeb valid>
    Dex -->> auth:OK
    auth ->> Dex : Allocate a JWT token
    Dex -->> auth :OK (JWT token,refresh token)
    auth -->> cli:OK (JWT token, refresh token)
    cli ->> env: set GALASA_BEARER_TOKEN
    cli ->> env: set GALASA_BEARER_REFRESH_TOKEN
    cli -->> toby: OK
```
