modules/framework/docs/design/authentication-design.md
```mermaid
sequenceDiagram
    actor toby as "Toby (Tester)" 
    participant cli as "CLI tool" 
    participant env as "Environment"     
    participant runsService as "Runs Service"

    toby->> cli: runs submit
            activate cli
            cli->> env: read GALASA_BEARER_TOKEN

            cli->>   runsService : post(runs,bearer-token) 
                    activate runsService
                    runsService->> Dex : Is this bearer token valid ?
                    Dex -->> runsService :OK

    note over runsService: The test runs can now go ahead.

                    runsService -->> cli:OK
                    deactivate runsService


    cli -->> toby: OK
    deactivate cli
```
